Rename secret server
